app/Models/AdminModel.php

	public function getrecords() {

		$builder = $this->db->table('users');
		$builder->select('*');
		$query = $builder->get();
---
SELECT *
FROM `users`